[
    {
        "advisory": "MATH 120",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Financial Accounting",
        "courseTitle": "ACCT 301",
        "description": "This is the study of accounting as an information system, examining why it is important and how it is used by investors, creditors, and others to make decisions.  The course covers the accounting information system, including recording and reporting of business transactions with a focus on the accounting cycle, the application of generally accepted accounting principles, the financial statements, and statement analysis.  It includes issues relating to asset, liability, and equity valuation, revenue and expense recognition, cash flow, internal controls, and ethics.  (C-ID ACCT 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b)",
        "hours": "72 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Managerial Accounting",
        "courseTitle": "ACCT 311",
        "description": "This is the study of how managers use accounting information in decision-making, planning, directing operations, and controlling. The course focuses on cost terms and concepts, cost behavior, cost structure, and cost-volume-profit analysis. It includes issues relating to cost systems, cost control, profit planning,ethics, segment reporting and performance analysis in manufacturing and service environments. This course is required of all business majors, minors, and accounting certificate candidates. Students must purchase (or have in their possession) a financial calculator for this course and may require (purchase or receive with text) an online access code from publisher's site. (C-ID ACCT 120)",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "72 hours LEC",
        "prerequisite": "ACCT 301 with a grade of C or better",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "4"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Accounting",
        "courseTitle": "ACCT 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Management. Course content will include understanding the application of education to the workforce completing required forms which document the student's progress and hours spent at the work site and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Administration of Justice",
        "courseTitle": "ADMJ 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Administration of Justice. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Physical Anthropology",
        "courseTitle": "ANTH 300",
        "description": "This course is designed to introduce students to the study of physical or biological anthropology, one of the sub-disciplines of anthropology. Physical anthropology considers the role of culture in the human biological experience. This course traces the evolution of the human line and examines our relationship to our closest living relatives, the non-human primates. This course provides an overview of human genetics, human variation, primatology, human and primate evolution, human growth and development, skeletal anatomy, and forensic anthropology.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B2; IGETC Area 5B",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Cultural Anthropology",
        "courseTitle": "ANTH 310",
        "description": "This course is an introduction to the varieties of customs and forms of social organizations found in our species. A multicultural, comparative approach is used to study the  structure and function of various economic, political, social and religious systems found in Western and non-Western societies.        (C-ID ANTH 120)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": "Drawing Fundamentals",
        "courseName": "Drawing and Composition I",
        "courseTitle": "ART 300",
        "description": "This course covers the fundamentals of drawing emphasizing the use of line, shape, value, perspective, space, and composition.  It introduces and uses various media and techniques for drawing.  This is a foundation requirement for all art students.  Students will need to purchase art materials and tools.   (C-ID ARTS 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area I; CSU Area C1",
        "hours": "36 hours LEC ; 54 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": "Drawing Fundamentals",
        "courseName": "Drawing and Composition II",
        "courseTitle": "ART 302",
        "description": "This course expands on the drawing skills presented in ART 300 and covers more complex problems in observation, personal expression, and the formal exploration of composition.  Students investigate subject, form, and content through the elements of art, principles of design, as well as diverse materials and techniques and historical and contemporary approaches to drawing. Students will need to purchase art materials and tools.  (C-ID ARTS 205)",
        "enrollmentLimitation": null,
        "generalEducation": "CSU Area C1",
        "hours": "36 hours LEC ; 54 hours LAB",
        "prerequisite": "ART 300 with a grade of C or better",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Art",
        "courseTitle": "ARTH 300",
        "description": "This is an introduction to the visual arts and architecture in various world cultures. Lecture and discussion include an  overview of different materials and techniques that are used for the visual arts, such as drawing, painting, sculpture, artifacts, architecture, and printmaking. Topics also include the study of theory, terminology, the meaning and function of art, roles of artists, elements of art, and principles of design to develop visual literacy.  (C-ID ARTH 100)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area I; CSU Area C1; IGETC Area 3A",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGRD 110 and MATH 100",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Astronomy",
        "courseTitle": "ASTR 300",
        "description": "This is a general course in astronomy that examines the nature and evolution of the solar system, stars, galaxies, cosmology and life in the universe.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B1; IGETC Area 5A",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 and MATH 100 with grades of C or better",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "The Foundations of Biology",
        "courseTitle": "BIOL 300",
        "description": "This course is a survey of major topics in the biological sciences for the non-science major with an emphasis on human biology.  Units covered include the origin of life, cell structure and chemistry, metabolism, Mendelian and molecular genetics, genetic engineering, evolution, anatomy and physiology of humans, animal behavior and ecology.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B2; IGETC Area 5B",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 and MATH 100 with grades of C or better; with a grade of C or better",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Biology of Organisms",
        "courseTitle": "BIOL 307",
        "description": "This is a general biology course focusing on a survey of the plant and animal kingdoms.  The course covers the general principles of biology including:  methods of science, cell organization, genetics, evolution, ecology, biodiversity, and anatomy.  These principles are explored in more depth through the examination of additional topics which may include:  disease and epidemiology, physiological ecology, animal behavior, biotechnology, population growth and regulation, ecosystem ecology, and conservation biology.  Evolution and biodiversity are continuing themes included in each major topic.  The course is designed for non-science majors and is especially useful for liberal studies, elementary education, environmental studies, recreation, and similar majors.  Field trips scheduled outside of class time (including day-length weekend field trips) may be required. Students may be required to purchase eye protection and disposable gloves.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B2; CSU Area B3; IGETC Area 5B; IGETC Area 5C",
        "hours": "54 hours LEC ; 54 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Business",
        "courseTitle": "BUS 300",
        "description": "This course provides a survey of various business areas, including accounting, regulation, negotiation, ethics, information technology, management, marketing, global competition, economics, finance, environmental factors, implementation, communications, leadership, and business planning.  The course is designed to be taken by all beginning students interested in business.  It is a core requirement for business majors.  (C-ID BUS 110)",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Managing Diversity in the Workplace",
        "courseTitle": "BUS 330",
        "description": "This course examines the leadership skills and abilities needed to manage a multicultural workforce.  A primary focus is placed upon the workplace impact of various historical, social, and cultural experiences/perspectives related to gender, age, ethnicity, and disability.  Workforce issues related to the diversity of the American consumer's and global consumer's impact on the United States are analyzed.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); AA/AS Area VI; CSU Area D",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Business",
        "courseTitle": "BUS 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Business. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Chemistry",
        "courseTitle": "CHEM 305",
        "description": "This course introduces fundamental principles of chemistry including types of matter and physical states, physical and chemical transformations, chemical equations and stoichiometry, bonding, atomic and chemical structure, intermolecular forces, gas laws, solutions, colligative properties, acids and bases, nuclear chemistry, and includes a brief introduction of organic chemistry. It is primarily intended for general education and majors in allied health (nursing, dental hygiene, respiratory care), family and consumer science, physical education, physical therapy(*), psychology(*), natural resources(*). Chem 305 can also be used as a preparatory course prior to enrolling in Chem 400. Students will require approved safety goggles for this course.     *May require CHEM 400.",
        "enrollmentLimitation": "Students must be 16 and at least sophomores in high school.  Minor aged students who are not legally emancipated must have their parent(s)/guardian review laboratory safety protocols prior to attending class.",
        "generalEducation": "AA/AS Area IV; CSU Area B1; CSU Area B3; IGETC Area 5A; IGETC Area 5C",
        "hours": "72 hours LEC ; 54 hours LAB",
        "prerequisite": "MATH 100 with a grade of C or better",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "5"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "General Chemistry",
        "courseTitle": "CHEM 400",
        "description": "This is a general college chemistry course intended for students majoring in the scientific disciplines including chemistry, biology, nutrition, physics, geology and engineering.  This course emphasizes the fundamental principles of chemistry.  Topics include chemical measurement; physical and chemical processes; nomenclature; stoichiometry; atomic structure; quantum theory; molecular structure; bonding theory; physical properties of gases, liquids, and solids; thermochemistry; and properties of solutions.  Students are required to purchase indirect vent safety goggles, closed toe shoes, and a bound quad-ruled notebook for the laboratory. (C-ID CHEM 110; Part of C-ID CHEM 120S)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B1; CSU Area B3; IGETC Area 5A; IGETC Area 5C",
        "hours": "54 hours LEC ; 108 hours LAB",
        "prerequisite": "CHEM 300, CHEM 305 or CHEM 310 (taken at any Los Rios College) with a grade of C or better; or one year in High School Chemistry with a lab earning a grade of C or better; and MATH 120.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "5"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Computer Information Science - Core",
        "courseTitle": "CISC 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Computer Information Science. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Public Speaking",
        "courseTitle": "COMM 301",
        "description": "This course prepares students to speak in a variety of rhetorical situations: academic, professional, social, and political. Students will demonstrate effective verbal and non-verbal delivery, ethical research methodology, analytical thinking and listening skills, organization and outlining skills, and appropriate presentation skills. In order to effectively assess oral communication competency, each student will complete a minimum of 22 minutes of evaluated speaking time.  Emphasis is on researching, preparing, organizing, writing and presenting a variety of speeches for different audiences. Video recording equipment may be used as an aid to the student's self-analysis and improvement.  Access to a computer with online capabilities may be required and is available on campus. (C-ID COMM 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); CSU Area A1; IGETC Area 1C",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better;  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Interpersonal Communication",
        "courseTitle": "COMM 321",
        "description": "Students in this course will explore and apply communication concepts associated with developing and maintaining satisfying interpersonal relationships.  Through a variety of class activities, students experiment with various approaches to successful communication in interpersonal contexts, including conflict management and active listening. Additionally, students will improve communication competency through a heightened awareness of the complexity of interpersonal communication and the development of skills as both senders and receivers of shared messages. (C-ID COMM 130)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b); CSU Area E1",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 51 with a grade of C or better;  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "The Communication Experience",
        "courseTitle": "COMM 361",
        "description": "This course introduces students to the fundamental concepts and skills necessary for effective interpersonal, small group and public communication. Course content includes an emphasis on both communication theory and practice by providing students with the opportunity to develop communication competency through a variety of presentation formats. Special emphasis is placed on practical experiences within groups, facilitation of interpersonal relationships, as well as message design and delivery for multiple purposes and to diverse audiences. In order to effectively assess oral communication competency, each student will complete a minimum of 22 minutes of evaluated speaking time. Videotaping may be required for this course. Access to a computer with online capabilities may be required and is available on campus.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); CSU Area A1; IGETC Area 1C",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better; eligibility for ENGWR 300.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Communication and Media Studies",
        "courseTitle": "COMM 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Communication and Media Studies. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Dance",
        "courseTitle": "DANCE 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Dance. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Principles and Practices in Early Childhood Education",
        "courseTitle": "ECE 300",
        "description": "This course provides an introduction to early childhood education, including an overview of the history of the field, evolution of professional practices and ethics, educational principles that support child development from birth through the school-age years, and teaching practices based on observation, documentation, and interpretation of children's behavior.   (C-ID ECE 120)",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or 103; or ESLL 310, ESLR 320, and ESLW 320.",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Child Development",
        "courseTitle": "ECE 312",
        "description": "This course will examine the physical, cognitive, social and emotional development of the child from the prenatal period through adolescence.  Scientific findings from a range of disciplines will inform an integrated examination of theory and practice during the childhood years.  This course is designed to fulfill General Education, Early Childhood Education and Psychology degree requirements.  This course is not open to those who have previously taken PSYC 372. (C-ID CDEV 100)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); AA/AS Area III(b); CSU Area D; CSU Area E1; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": "PSYC 372",
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "The Child, the Family and the Community",
        "courseTitle": "ECE 314",
        "description": "This fundamental course examines socialization and developmental processes of the child within the family and the environmental  influences on growth and development; including gender, peers, schooling, the media, socioeconomic status, race, ethnicity, language, and developmental differences. Community resources available to support family systems and dynamics will be examined. (C-ID CDEV 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b); CSU Area D; CSU Area E1",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ECE 312 or NUTRI 300",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Children's Health, Safety and Nutrition",
        "courseTitle": "ECE 415",
        "description": "This course provides an introduction to the laws, regulations, standards, policies and procedures and early childhood curriculum related to child health safety and nutrition. The key components that ensure physical health, mental health and safety for both children and staff will be identified along with the importance of collaboration with families and health professionals. There is a focus on integrating the concepts into everyday planning and program development for all children. This course is not open to students who have received credit for NUTRI 320.   (C-ID ECE 220)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b)",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": "NUTRI 320",
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Administration II: Personnel and Leadership in Early Childhood Education",
        "courseTitle": "ECE 422",
        "description": "This course covers effective strategies for personnel management and leadership in early care and education settings. It includes legal and ethical responsibilities, supervision techniques, professional development, and reflective practices for a diverse and inclusive early care and education program.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "54 hours LEC",
        "prerequisite": "ECE 320 and 420  with grades of C or better",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Early Childhood Education",
        "courseTitle": "ECE 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Early Childhood Education. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Principles of Macroeconomics",
        "courseTitle": "ECON 302",
        "description": "This course is a graphical and functional analysis of the economy as a whole.  It focuses on the economy's well-being, problems, and possible solutions.  Major topics include:  market demand and supply; macroeconomic sectors, goals, and problems (unemployment, inflation, business cycles, and deficits); the economy's output and price level; aggregate demand, aggregate supply, and equilibrium; and macroeconomic policies (fiscal and monetary) aimed at solving problems and stabilizing the economy.  Related topics such as international trade, international finance, and economic growth are also discussed.  Coursework includes solving algebraic equations and graphing straight and curvilinear lines as taught in Intermediate Algebra. (C-ID ECON 202)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "MATH 120 with a grade of C or better,  or placement through the assessment process.; or one full year of High School Algebra II with grades of C or better in each semester.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Principles of Microeconomics",
        "courseTitle": "ECON 304",
        "description": "This course is a graphical and functional analysis of the units (sectors) making up the economy. The focus is on the sectors choices and interactions, microeconomic goals (efficiency and equity), problems, and solutions. Major topics include basic principles of economics; basic economic analyses; demand, supply, and equilibrium in a market; markets and applications; costs and production; product and resources markets; and microeconomic problems (externalities, public goods, and income inequality). Time permitting, related topics such as international trade and health economics may also be discussed. Coursework includes doing arithmetic problems, solving algebraic equations, and graphing straight and curvilinear lines. (C-ID ECON 201)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "MATH 120 with a grade of C or better,  or placement through the assessment process.; or one full year of High School Algebra II with grades of C or better in each semester.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGLB 71 or ENGRD 18",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Critical Reading as Critical Thinking",
        "courseTitle": "ENGRD 310",
        "description": "This course covers the theory and practice of critical reading as critical thinking for successful academic performance. The course emphasizes the following areas: logic and its relation to written text; inductive and deductive reasoning; formal and informal fallacies; academic vocabulary advancement; development of effective and flexible reading rates; proficiency of textual comprehension; identification of rhetorical elements; discernment between factual evidence and opinion; strategic application of these abilities in reading university level texts. This course meets reading competency.One or more hours per week may be required in the Folsom Lake College Reading and Writing Center or English Center. (Competency: Reading)",
        "enrollmentLimitation": "This course is not open to students who have successfully completed a three unit reading class at the ENGRD 200 level.",
        "generalEducation": "AA/AS Area II(b); CSU Area A3",
        "hours": "54 hours LEC",
        "prerequisite": "ENGRD 110 or ESLR 320 with a grade of C or better,  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "College Writing",
        "courseTitle": "ENGWR 101",
        "description": "This writing course, designed to prepare the student for ENGWR 300, will focus on reading and writing as integrally related skills.  Students will study and practice such things as the writing process, summarizing, critical thinking, creating clear/varied correct sentences and incorporating sources as they develop the skills necessary to write a variety of focused, developed, organized essays.  Students will be responsible for writing at least six full-process essays (500 word minimum per essay).",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "72 hours LEC",
        "prerequisite": "ENGWR 51 or ESLW 320 with a grade of C or better,  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": null,
        "units": "4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "College Composition",
        "courseTitle": "ENGWR 300",
        "description": "This course emphasizes writing and includes reading, research, and critical thinking skills essential for successful completion of a college degree.  Writing assignments include expository and argumentative essays (6,000 words minimum for course) using MLA documentation and format.  Reading assignments include a variety of transfer-level texts of substantial length including one full-length literary work.  (C-ID ENGL  100; Competency: Writing)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(a); CSU Area A2; IGETC Area 1A",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better,  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "College Composition and Literature",
        "courseTitle": "ENGWR 301",
        "description": "This course offers study and practice in critical reading of and analytical writing about literature. Students read fiction, poetry, drama, nonfiction, and criticism from diverse cultural sources and perspectives. With a minimum of six critical essays totaling 6500 words, and the use of relevant external sources, students analyze, criticize,  reason inductively and deductively, and reach evaluative conclusions based on evidence and sound inferences derived from their close readings of literary texts. (C-ID ENGL 120)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); AA/AS Area I; CSU Area A3; CSU Area C2; IGETC Area 1B",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 300 with a grade of C or better",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Advanced Composition and Critical Thinking",
        "courseTitle": "ENGWR 302",
        "description": "This course is designed for students who have had ENGWR 300 and who desire further instruction in the techniques of effective critical thinking as expressed in written argument and by the major principles of advanced composition and rhetoric. Essays written for the course (6,000 words minimum) draw from a variety of texts and contexts to present carefully reasoned arguments. (C-ID ENGL 105)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); CSU Area A3; IGETC Area 1B",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 300 with a grade of C or better",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Water, Wastewater and Recycled Water Management",
        "courseTitle": "ENVT 355",
        "description": "This course provides an introduction to water, wastewater and recycled water management. Topics covered include management of public and private utilities, the history of water supply and treatment, wastewater collection and treatment, and recycling water in the world and in the United States; and an overview of the State and federal regulations governing water supply, wastewater treatment and recycled water use, including permitting requirements and operator certification program.   This course provides an introduction to managing water and wastewater systems. Field trips will be required.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Environmental Technology",
        "courseTitle": "ENVT 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Environmental Technology. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Building Construction for Fire Protection",
        "courseTitle": "FT 303",
        "description": "This course addresses the components of building construction that relate to the fire service.  Specific focus is on elements of construction and the design of structures that are shown to be key factors when inspecting buildings, pre-planning fire operations and emergency operations at fires. Topics include wood, masonry, steel, and concrete construction, principles of fire and smoke growth, and fire resistance construction, the relationship between building types and Urban Search & Rescue Team capacity and Wildland/Urban Interface building requirements.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Fire Technology",
        "courseTitle": "FT 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Fire Technology. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": "GEOG 301",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Physical Geography: Exploring Earth's Environmental Systems",
        "courseTitle": "GEOG 300",
        "description": "This course investigates the interrelationships between Earth and humans, with an emphasis on natural systems (solar energy balance, weather and climate, water resources, landforms, natural hazards,  vegetation, and soil).  Relevant application of these elements to today's world is stressed to help students better understand Earth's physical environment as well as human-environment interaction.   A field trip may be required to relate class discussions to the real world. (C-ID GEOG 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B1; IGETC Area 5A",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": "GEOL 306",
        "courseFamily": null,
        "courseName": "Earth Science",
        "courseTitle": "GEOL 305",
        "description": "This course is an introductory course covering major topics in geology, oceanography, meteorology, astronomy, scientific method, and philosophy of science.  This course is designed for non-science majors. (C-ID GEOL 120)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area IV; CSU Area B1; IGETC Area 5A",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Health Science",
        "courseTitle": "HEED 300",
        "description": "This course is designed to help students achieve a high level of health and prevent disease by assisting them to maximize both their personal lifestyles and their environments.  This course will help students identify various factors influencing current and future levels of health.  Additional information includes mental health, stress management, nutrition, weight control, fitness, sexuality, addictive substances, and disease.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b); CSU Area E1",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "History of World Civilizations to 1500",
        "courseTitle": "HIST 307",
        "description": "This course is a survey of the development of world civilizations from antiquity to 1500 CE, with particular emphasis on the dynamic interaction and comparison of peoples and cultures.  The focus is on the roles played by social, political, economic, cultural and religious forces in shaping the major world civilizations and the legacy of these civilizations within the world today.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); AA/AS Area I (effective Summer 2017); CSU Area C2; CSU Area D; IGETC Area 3B; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better; or placement into ENGWR 300.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "History of World Civilizations, 1500 to Present",
        "courseTitle": "HIST 308",
        "description": "This course is a survey of the development of the major civilizations of the world from the 16th century to the present, with particular emphasis on the dynamic interaction of peoples and cultures.  The focus is on the role played by social, political, economic, cultural and religious forces in shaping the major world civilizations and the legacy of these civilizations within the world today.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); AA/AS Area I (effective Summer 2017); AA/AS Area VI; CSU Area C2; CSU Area D; IGETC Area 3B; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better; or placement into ENGWR 300.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "History of the United States (to 1865)",
        "courseTitle": "HIST 312",
        "description": "This course portrays the growth of the history of America from the pre-Columbian period to 1865 focusing on its institutions and ideals, examining the decisions and developments that shaped our national heritage. The U.S. Constitution and the establishment of American government institutions are also covered.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(a); CSU Area D; CSU Area F1; CSU Area F2; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better; or eligibility for ENGWR via the assessment process.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "History of the United States (1865-1945)",
        "courseTitle": "HIST 313",
        "description": "This course portrays America's development from the period of Reconstruction following the Civil War in 1865 through the end of the Second World War in 1945, examining the significant ideals, decisions, forces, institutions, individuals, events, and processes that affected continuity and change during this time.  Coverage also includes California state and local government.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(a); CSU Area D; CSU Area F1; CSU Area F3; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better; or eligibility for ENGWR via the assessment process.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "College Success",
        "courseTitle": "HCD 310",
        "description": "This comprehensive course is designed to assist students in obtaining the skills and knowledge necessary to reach their educational objectives.  Topics include:  motivation and discipline, memory development, time management, communication skills, career planning, transfer options, study skills, and personal issues commonly reported by college students.  The course is recommended for new students and others who can benefit.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b); CSU Area E1",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Classical Humanities",
        "courseTitle": "HUM 300",
        "description": "The course focuses upon Western culture in its attempt to interpret human experience and identity.  The course examines basic human values as exemplified in the arts, philosophy and history.  Emphasis is on the Greeks, the Romans, and the Judeo-Christian traditions up to the end of the Middle Ages. Humanities students at FLC may be required to attend a cultural event during the semester at their own expense. In addition, students may be asked to purchase a student response system as part of their course materials.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area I; CSU Area C2; IGETC Area 3B",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Modern Humanities",
        "courseTitle": "HUM 310",
        "description": "This course focuses upon Western culture in its attempt to interpret human experience and identity.  The course examines basic human values as exemplified in the arts, philosophy, and history.  Emphasis is on the Renaissance, the Baroque period, and the Modern age. Humanities students at FLC may be required to attend a cultural event during the semester at their own expense. In addition, students may be asked to purchase a student response system as part of their course materials.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area I; CSU Area C2; IGETC Area 3B",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "American Humanities",
        "courseTitle": "HUM 332",
        "description": "This course examines ideas and values about the American experience by analyzing the literature, art, music, philosophy and history from the beginning of the twentieth-century to the present.   The course draws upon the arts of African American, Native American, Asian American, Anglo and Latino cultures as avenues for understanding issues of race, ethnicity, class, and gender as they intersect with mainstream American values. Humanities students at FLC may be required to attend a cultural event during the semester at their own expense. In addition, students may be asked to purchase a student response system as part of their course materials.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area I; AA/AS Area VI; CSU Area C2; IGETC Area 3B",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Human Services",
        "courseTitle": "HSER 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Human Services. Course content will include understanding the application of education to the workforce, completing required forms which document the student's progress and hours spent at the work site, and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Library Research and Information Literacy",
        "courseTitle": "LIBR 318",
        "description": "This course will help students acquire the information competency skills necessary to conduct academic, professional and personal research.  It provides a step-by-step guide to the research process that is applicable to course work, professional work and life-long learning. It emphasizes developing effective search strategies, selecting information tools, locating and retrieving information sources, analyzing and critically evaluating information and organizing and using information in an ethical manner.",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b)",
        "hours": "18 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "1"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Arithmetic",
        "courseTitle": "MATH 20",
        "description": "This course provides group and individual instruction in the fundamentals of arithmetic with an emphasis on written and mental computational skills.  In order to enhance mental computational skills, calculators will not be allowed.  Topics include operations with whole numbers, fractions, decimals, signed numbers, percents, ratios, proportions, problem solving, and applications involving measurement and geometry.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "90 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": null,
        "units": "5"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Pre-Algebra Mathematics",
        "courseTitle": "MATH 30",
        "description": "This course in prealgebra mathematics emphasizes the fundamental operations on integers and decimals as well as in geometric figures, measurement, and algebra with an emphasis on written and mental computational skills. Topics include: fractions; decimals; signed numbers; properties of exponents; scientific notation; evaluation of expressions and formulas; linear equations; algebraic manipulations on polynomials; and the rectangular coordinate system.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "90 hours LEC",
        "prerequisite": "MATH 20 or 25  with a grade of C or better;  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": null,
        "units": "5"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Elementary Algebra",
        "courseTitle": "MATH 100",
        "description": "This course includes the fundamental concepts and operations of algebra with problem solving skills emphasized throughout.  Topics include: properties of real numbers, linear equations and inequalities, integer exponents, polynomials, factoring polynomials, rational expressions and equations, radical expressions and equations, systems of linear equations and inequalities, the rectangular coordinate system, graphs and equations of lines, and solving quadratic equations.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "90 hours LEC",
        "prerequisite": "MATH 30 with a grade of C or better;  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": null,
        "units": "5"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Intermediate Algebra",
        "courseTitle": "MATH 120",
        "description": "This course reviews and extends the concepts of elementary algebra with problem solving skills emphasized throughout. Topics which are reviewed and extended include: linear and quadratic equations, factoring polynomials, rational expressions, exponents, radicals, equations of lines, and systems of equations. New topics include: larger systems of equations, absolute value equations and inequalities, rational exponents, translations and reflections of key function graphs, function notation and function operations, exponential and logarithmic functions, graphs of quadratic and simple polynomial functions, quadratic inequalities, non-linear systems of equations, and an introduction to conic sections. (Competency: Mathematics)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b)",
        "hours": "90 hours LEC",
        "prerequisite": "MATH 100 with a grade of C or better,  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": null,
        "units": "5"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Trigonometry with College Algebra",
        "courseTitle": "MATH 335",
        "description": "This is a full trigonometry course with college algebra concepts reviewed, extended, and integrated when they are relevant to the trigonometric concepts.  The trigonometric topics include right triangle trigonometry, unit circle trigonometry, graphs of trigonometric functions, proofs of trigonometric identities, solving trigonometric equations, applications of trigonometric functions (laws of sines and cosines), inverse trigonometric functions, polar coordinates, graphing polar functions, and vectors.  The algebra topics include exponential and logarithmic functions, complex numbers, in addition to solving equations, inequalities, and systems of equations.  A graphing calculator may be required for this course. (Competency: Mathematics)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); CSU Area B4",
        "hours": "90 hours LEC",
        "prerequisite": "Math 120 (Intermediate Algebra) and Geometry; both with a grade of C or better; or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "5"
    },
    {
        "advisory": "BIOL 300 and CHEM 305 with grades of C or better",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Nutrition",
        "courseTitle": "NUTRI 300",
        "description": "This course examines nutrition as a science and the chemical properties of nutrients in foods, the sources and functions of the nutrients in all stages of the life cycle, as well as nutrition as a world problem, and consumer problems related to food. Topics emphasized include nutrient metabolism, weight loss, sports nutrition, food safety, the diet-disease relationship, global nutrition and analysis of special nutritional requirements from the prenatal period through the geriatric years.  An evaluation of personal dietary habits using current dietary guidelines and nutritional assessment methods will be completed to help students analyze their own nutritional health using scientific principles. Students will be required to complete a personalized dietary analysis. (C-ID NUTR 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b); CSU Area E1",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ECE 312 or NUTRI 300",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Children's Health, Safety and Nutrition",
        "courseTitle": "NUTRI 320",
        "description": "This course provides an introduction to the laws, regulations, standards, policies and procedures and early childhood curriculum related to child health safety and nutrition. The key components that ensure physical health, mental health and safety for both children and staff will be identified along with the importance of collaboration with families and health professionals. There is a focus on integrating the concepts into everyday planning and program development for all children. This course is not open to students who have received credit for ECE 415.   (C-ID ECE 220)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area III(b)",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": "ECE 415",
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101, ESLR 320, and ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Philosophy",
        "courseTitle": "PHIL 300",
        "description": "In this course, students will apply the critical thinking techniques of analysis, evaluation, and synthesis to areas of philosophical inquiry including meta-philosophy, epistemology, metaphysics, ethics, political philosophy, philosophy of religion, history of philosophy, and existentialism. Students will practice distinguishing fact from opinion, employing inductive and deductive reasoning, identifying logical errors and fallacies, and developing oral and written arguments to support their own philosophical perspectives or challenge the perspectives of others.  The quality of the course's required writing will reflect the standards of a college-level writing course. (C-ID PHIL 100)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); AA/AS Area I ; CSU Area A3; CSU Area C2; IGETC Area 3B",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Photography",
        "courseTitle": "PHOTO 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Photography. Course content will include understanding the application of education to the workforce completing required forms which document the student's progress and hours spent at the work site and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Physical Education",
        "courseTitle": "KINES 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Physical Education. Course content will include understanding the application of education to the workforce completing required forms which document the student's progress and hours spent at the work site and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Yoga",
        "courseTitle": "FITNS 392",
        "description": "Yoga is an East Indian method of mind/body exercise designed to stretch, strengthen, and enhance muscle tone through the practice of asanas (poses) and pranayama (breathing exercises).  Yoga practice plus meditation helps decrease stress and increase energy levels while improving focus, concentration, and self-realization. Students will be required to purchase a yoga mat.",
        "enrollmentLimitation": "None.",
        "generalEducation": "AA/AS Area III(a); CSU Area E2",
        "hours": "54 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "1"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Pre-Season Conditioning For Women's Soccer",
        "courseTitle": "SPORT 357",
        "description": "This course covers pre-season training and conditioning skills and techniques specific for intercollegiate soccer. Topics include skill development, strength training, cardiovascular conditioning, and speed training. Students will need to provide appropriate soccer attire, soccer cleats, and shin guards.   This course may be taken four times for credit.",
        "enrollmentLimitation": "The student must demonstrate intercollegiate athletic soccer skills as determined by a try-out conducted by the coaching staff to remain in the course.",
        "generalEducation": "AA/AS Area III(a); CSU Area E2",
        "hours": "162 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": ".5-3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Pre-Season Conditioning for Men's Soccer",
        "courseTitle": "SPORT 358",
        "description": "This course covers pre-season training and conditioning skills and techniques specific for intercollegiate soccer. Topics include skill development, strength training, cardiovascular conditioning, and speed training. Students will need to provide appropriate soccer attire, soccer cleats, and shin guards. This course may be taken four times for credit.",
        "enrollmentLimitation": "The student must demonstrate intercollegiate athletic soccer skills as determined by a try-out conducted by the coaching staff to remain in the course.",
        "generalEducation": "AA/AS Area III(a); CSU Area E2",
        "hours": "162 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": ".5-3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Pre-Season Conditioning for Volleyball",
        "courseTitle": "SPORT 403",
        "description": "This course involves a combination of skill development and strategy tactics with an emphasis on a fitness component for volleyball. The course will also offer a mental training component for peak performance. This course is designed to prepare students for intercollegiate volleyball competition.  Students will be required to provide appropriate volleyball attire, shoes, and kneepads.  This course may be taken up to four times.",
        "enrollmentLimitation": "Once enrolled, the student must demonstrate intercollegiate athletic skills as determined by the coaching staff to remain enrolled in this course. It is advised that athletes taking this course have participated at the varsity level in high school or competed on a summer travel team.",
        "generalEducation": "AA/AS Area III(a); CSU Area E2",
        "hours": "162 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": ".5-3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Government: United States",
        "courseTitle": "POLS 301",
        "description": "This course is an introduction to political science, American government and politics and is structured to promote political and analytical understanding and thinking regarding American politics and government.  Areas of concentration include principles, institutions, problems, processes, theory, philosophy, and ideology. (C-ID POLS 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(a); CSU Area D; CSU Area F2; CSU Area F3; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "ENGWR 101 with a grade of C or better; or placement into ENGWR 300.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Project Integration and Scope Management",
        "courseTitle": "PRJMGT 310",
        "description": "Successful project outcomes depend on an effective project management plan, development and execution, as well as adherence to a scope management process. This also begins with the proper integration of related project elements across project process groups and knowledge areas.     The course builds on the introductory project management class to explore the project integration management processes to successfully integrate processes and activities required to define and coordinate the project effort within and across the project process including: project plan development, project plan execution, and overall change control.",
        "enrollmentLimitation": null,
        "generalEducation": null,
        "hours": "54 hours LEC",
        "prerequisite": "PRJMGT 300 with a grade of C or better",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "General Principles",
        "courseTitle": "PSYC 300",
        "description": "Psychology is the scientific study of behavior and mental processes. The content focuses on the exploration of major psychological theories and concepts, methods, and research findings in psychology. Topics include the biological bases of behavior, perception, cognition and consciousness, learning, memory, emotion, motivation, development, personality, social psychology, psychological disorders and therapeutic approaches, and applied psychology. This course is designed for psychology majors, behavioral and social science majors, and other students who desire a broad overview of the field. (C-ID PSY 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Social Psychology",
        "courseTitle": "PSYC 320",
        "description": "This course focuses on the scientific study of human interaction, with an emphasis on the individual within a social context. Study includes: social perception, social cognition, attitudes and attitude change, the self and social identity, prejudice, interpersonal attraction, close relationships, social influence, prosocial behavior, aggression, and group behavior. (C-ID PSY 170)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Human Sexuality",
        "courseTitle": "PSYC 356",
        "description": "This course offers a balanced scientific understanding of the biopsychosocial perspective on human sexual behavior from birth through adulthood. The course provides factual, up-to-date nonjudgmental information designed to dispel myths, facilitate problem identification and possible solutions. The course explores the impact of cultural influences on human sexual behaviors of different ethnic groups.  A survey of the historical, biological, psychological and sociocultural perspectives and aspects of the diversity of human sexual behavior is compared and contrasted. Topics include sexual anatomy and physiology, conception and childbirth, contraception, sexual development, variations and deviations, sex research, sexually transmitted diseases, sex therapy, intimacy and relationships, and sexual victimization. (C-ID PSY 130)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b) ; AA/AS Area III(b); AA/AS Area VI; CSU Area D; CSU Area E1; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or 103; or ESLL 310, ESLR 320, and ESLW 320.",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Child Development",
        "courseTitle": "PSYC 372",
        "description": "This course will examine the physical, cognitive, social and emotional development of the child from the prenatal period through adolescence. Scientific findings and theoretical insights from a range of disciplines will inform an integrated examination of development during the childhood years. This course is designed to fulfill general education, Psychology degree, and Early Childhood Education requirements. This course is not open to those who have previously taken ECE 312. (C-ID CDEV 100)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); AA/AS Area III(b); CSU Area D; CSU Area E1; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": "ECE 312",
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introductory Sociology",
        "courseTitle": "SOC 300",
        "description": "This course introduces the social and cultural bases that impact human behavior, social interaction, and life opportunities.  This course will cover sociological concepts, theoretical approaches, and major fields of sociological inquiry including culture, socialization, social structures and institutions, inequalities and stratification, deviance, and social change.   (C-ID SOCI 110)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Social Problems",
        "courseTitle": "SOC 301",
        "description": "This course investigates current social problems in the United States.  It examines these problems through sociological and ideological perspectives and evaluates how these perspectives influence both definitions of problems as well as proposed solutions.  Topics include: racism, economic inequality, sexism and heterosexism, as well as problems arising in the areas of education, marriage and family, crime, health and healthcare, and the environment.  Particular attention is paid to the impact of media on perceptions of social problems. (C-ID SOCI 115)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area V(b); CSU Area D; IGETC Area 4",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to Probability and Statistics",
        "courseTitle": "STAT 300",
        "description": "This course is an introduction to probability and statistics.  Topics include: elementary principles and applications of descriptive statistics,  elementary probability principles, probability distributions, estimation of parameters, hypothesis testing, linear regression and correlation, and ANOVA.  Statistical analysis using a computer statistics package or graphing calculator will be required. (C-ID MATH 110; Competency: Mathematics)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area II(b); CSU Area B4; IGETC Area 2",
        "hours": "72 hours LEC",
        "prerequisite": "MATH 120 with a grade of C or better,  or placement through the assessment process.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "4"
    },
    {
        "advisory": null,
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Introduction to the Theatre",
        "courseTitle": "TA 300",
        "description": "This theatre arts survey course focuses on the relationship of theatre to various cultures throughout history, and on the contributions of significant individual artists.  This course introduces students to elements of the production process including playwriting, acting, directing, design, and criticism. Students will also survey different periods, styles, and genres of theatre through play reading, discussion, films, and viewing and critiquing live theatre, including required attendance of theatre productions. Field trips might be required. (C-ID THTR 111)",
        "enrollmentLimitation": null,
        "generalEducation": "AA/AS Area I; CSU Area C1; IGETC Area 3A",
        "hours": "54 hours LEC",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "UC/CSU",
        "units": "3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in Theatre Arts",
        "courseTitle": "TA 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within the field of Theatre Arts. Course content will include understanding the application of education to the workforce completing required forms which document the student's progress and hours spent at the work site and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    },
    {
        "advisory": "ENGWR 101 and ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience - General",
        "courseTitle": "WEXP 198",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment or advancement within their current job. Course content will include understanding the application of education to the workforce; completion of required forms which document the student's progress and hours spent at the work site; and developing workplace skills and competencies. During the semester, the student is required to attend a weekly orientation. Additionally, students must complete 75 hours of paid work experience, or 60 hours of unpaid work experience, for one unit. An additional 75 hours of paid work experience or 60 hours of unpaid work experience is required for each additional unit. The course may be taken two times for credit, when there is new or expanded learning on the job, for a maximum of 6 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an e-mail account. First time students are required to attend a weekly orientation and a final meeting. Returning participants are required to attend the first class meeting, a mid-semester meeting and a final meeting and may meet individually with the instructor as needed. Students may take up to 16 units total across all Work Experience course offerings. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Students must be in a paid or unpaid internship, volunteer position or job.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "225 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": null,
        "units": "1-3"
    },
    {
        "advisory": "ENGWR 101 or ESLW 320",
        "corequisite": null,
        "courseFamily": null,
        "courseName": "Work Experience in (Subject)",
        "courseTitle": "WEXP 498",
        "description": "This course provides students with opportunities to develop marketable skills in preparation for employment in their major field of study or advancement within their career. Course content will include understanding the application of education to the workforce completing required forms which document the student's progress and hours spent at the work site and developing workplace skills and competencies. During the semester, the student is required to attend orientation. Students must complete 75 hours of related paid work experience, or 60 hours of related unpaid work experience, for one unit. An additional 75 hours of related paid work experience or 60 hours of related unpaid work experience is required for each additional unit. The course may be taken for a maximum of 16 units. Students should have access to a computer, the Internet, and some computer media such as a USB drive to store data files. Online students must have an email account. Only one Work Experience course may be taken per semester.",
        "enrollmentLimitation": "Student must be in a paid or non-paid internship, volunteer opportunity, or job related to career interests.",
        "generalEducation": "AA/AS Area III(b)",
        "hours": "300 hours LAB",
        "prerequisite": "None.",
        "sameAs": null,
        "transferableTo": "CSU",
        "units": "1-4"
    }
]