[
    {
        "date": "02/16/2017 | 12 PM - 1:00 p.m",
        "description": null,
        "id": "0",
        "location": "El Dorado Center",
        "title": "EDC Day on the Greens"
    },
    {
        "date": "02/17/2017",
        "description": "Folsom Lake College (including the El Dorado Center and Rancho Cordova Center) is closed in observance of Abraham Lincoln's birthday on Friday, February 17. No classes will be held.",
        "id": "1",
        "location": "All campuses",
        "title": "Lincoln Holiday (college closed)"
    },
    {
        "date": "02/20/2017",
        "description": "Folsom Lake College (including the El Dorado Center and Rancho Cordova Center) is closed in observance of George Washington's birthday on Monday, February 20. No classes will be held.",
        "id": "2",
        "location": "All campuses",
        "title": "Washington Holiday (college closed)"
    },
    {
        "date": "02/21/2017 | 12:30 p.m - 1:30 p.m",
        "description": "The FLC Wisdom Book Club will meet every Tuesday, Starting January 31. For the full Wisdom Book Club schedule check with the facilitator, Mary Hansen: hansenm@flc.losrios.edu",
        "id": "3",
        "location": "Folsom campus, Gymnasium, G-185",
        "title": "The FLC Wisdom Book Club"
    },
    {
        "date": "02/22/2017 | 12 PM - 1:00 p.m",
        "description": "The Folsom Lake College Work Experience & Internship Program, along with the Career & Transfer Services Center present the Spring 2017 Career Speaker Series: Conversations with the Pros: Where Faculty Meets Industry. This workshop will explore careers in Human Services.Do you know what you can do with your major?&bull; Learn what it's really like to work in your field.&bull; Find out about internship and job opportunities available for your major.&bull; Network with employers (bring your resume!).For more information, please contact: Julie Collier at colliej@flc.losrios.edu or (916) 608-6552",
        "id": "4",
        "location": "Folsom campus,  Falcon's Roost, Peregrine Room (FR-240)",
        "title": "Careers in Human Services"
    },
    {
        "date": "02/22/2017 | 12 PM - 1:00 p.m",
        "description": "Major Decisions (Strategies for Choosing a Major): Do you struggle with the question So....what's your major? This workshop will help you explore majors that reflect your interests, abilities and values .Learn about self-assessment tools and online resources to discover your career path.",
        "id": "5",
        "location": "Folsom campus, Career & Transfer Services Center (lower level of Falcon's Roost, room FR-115)",
        "title": "Choosing a Major workshop"
    },
    {
        "date": "02/22/2017 | 12 PM - 3:00 p.m",
        "description": "FLC Men's Golf match Big 8 #3For more information on FLC Athletics, click here.",
        "id": "6",
        "location": "Rancho Murieta Golf Club, 7000 Alameda Dr, Rancho Murieta",
        "title": "Men's Golf Match"
    },
    {
        "date": "02/23/2017 | 1:00 p.m - 4:00 p.m",
        "description": "FLC Women's Tennis Team vs. Santa RosaFor more information on FLC Athletics, click here.",
        "id": "7",
        "location": "Folsom campus, Tennis Courts",
        "title": "Women's  Tennis Match"
    },
    {
        "date": "02/23/2017 | 1:00 p.m - 4:00 p.m",
        "description": "FLC Men's Tennis Team vs. Santa RosaFor more information on FLC Athletics, click here.",
        "id": "8",
        "location": "Folsom campus, Tennis Courts",
        "title": "Men's Tennis Match"
    },
    {
        "date": "02/24/2017 | 12 PM - 4:00 p.m",
        "description": "FLC Women's Softball Team vs. Redwoods. Double header: 12 noon and 2:00 pmFor more information on FLC Athletics, click here.",
        "id": "9",
        "location": "Folsom campus, Softball Field",
        "title": "Women's Softball Game"
    },
    {
        "date": "02/24/2017 | 1:00 p.m - 4:00 p.m",
        "description": "FLC Women's Tennis Team vs. SolanoFor more information on FLC Athletics, click here.",
        "id": "10",
        "location": "Folsom campus, Tennis Courts",
        "title": "Women's Tennis Match"
    },
    {
        "date": "02/24/2017 | 1:00 p.m - 4:00 p.m",
        "description": "FLC Men's Tennis Team vs. SolanoFor more information on FLC Athletics, click here.",
        "id": "11",
        "location": "Folsom campus, Tennis Courts",
        "title": "Men's Tennis Match"
    },
    {
        "date": "02/27/2017 | 12 PM - 1:00 p.m",
        "description": "College life can be challenging and stressful. Staying focused and balanced is essential. This Meditation Group meets every Tuesday to help students and staff be mindful of what is important for a quiet, centering, non-judgmental and relaxing hour. There is usually a facilitated meditation, a brief relaxation activity, and always time for discussion and support. Join us!",
        "id": "12",
        "location": "Folsom campus, Phycial Education, PE-204",
        "title": "Meditation Group"
    },
    {
        "date": "02/27/2017 | 2:00 p.m - 5:00 p.m",
        "description": "FLC Men's Baseball Team vs. MendocinoFor more information on FLC Athletics, click here.",
        "id": "13",
        "location": "Folsom campus, Baseball Field",
        "title": "Men's Baseball Game"
    },
    {
        "date": "02/27/2017 | 5:30 p.m - 8:30 p.m",
        "description": "The film, Planet Rock, takes a look at the rise of crack cocaine in urban America in the 1980s and it's influence on popular culture, especially in hip-hop music. Check here for additional Social Justice Spring events: http://bit.ly/flc100days",
        "id": "14",
        "location": "Folsom campus, Aspen Hall FL1-8",
        "title": "Film: Planet Rock"
    },
    {
        "date": "02/28/2017 | 12 PM - 1:00 p.m",
        "description": "Join students and experts for a deep discussion about the rising climate of hate at the national and local levels. Check here for additional Social Justice Spring events: http://bit.ly/flc100days",
        "id": "15",
        "location": "Folsom campus, Aspen Hall, FL1-20 (Community Room)",
        "title": "Combat Islamaphobia!"
    },
    {
        "date": "02/28/2017 | 2:00 p.m - 5:00 p.m",
        "description": "FLC Men's Baseball Team vs. Sacramento CityFor more information on FLC Athletics, click here.",
        "id": "16",
        "location": "Folsom campus, Baseball Field",
        "title": "Men's Baseball Game"
    }
]