[
    {
        "date": "03/28/2017 | 10:00 a.m - 2:00 p.m",
        "description": "For more info, click here.",
        "id": "0",
        "location": "Folsom campus, near Falcon's Roost",
        "title": "Blood Drive @ Folsom"
    },
    {
        "date": "03/28/2017 | 12 PM - 1:00 p.m",
        "description": "These information sessions will provide information on the application process, financial aid, cost, and the exciting experiences you'll have while studying abroad.Upcoming TripsSummer 2017 - Florence, ItalyFall 2017 - Barcelona, SpainSpring 2018 - Florence, ItalyContactsSummer 2017 Florence, ItalyBill Wrightson - WrightW@arc.losrios.eduFall 2017 Barcelona, SpainSteve James - JamesS@scc.losrios.eduSpring 2018 Florence, ItalyMarcia McCormick - mccormm@arc.losrios.edu",
        "id": "1",
        "location": "Folsom campus, Aspen Hall FL1-8",
        "title": "Study Abroad info session"
    },
    {
        "date": "03/28/2017 | 12:30 p.m - 1:30 p.m",
        "description": "The FLC Wisdom Book Club will meet every Tuesday, Starting January 31. For the full Wisdom Book Club schedule check with the facilitator, Mary Hansen: hansenm@flc.losrios.edu",
        "id": "2",
        "location": "Folsom campus, Gymnasium, G-185",
        "title": "The FLC Wisdom Book Club"
    },
    {
        "date": "03/28/2017 | 2:30 p.m - 5:30 p.m",
        "description": "FLC Men's Baseball Team vs. American RiverFor more information on FLC Athletics, click here.",
        "id": "3",
        "location": "Folsom campus, Baseball Field",
        "title": "Men's Baseball Game"
    },
    {
        "date": "03/28/2017 | 3:00 p.m - 6:00 p.m",
        "description": "FLC Women's Softball Team vs. DeltaFor more information on FLC Athletics, click here.",
        "id": "4",
        "location": "Folsom campus, Softball Field",
        "title": "Women's Softball Game"
    },
    {
        "date": "03/28/2017 | 5:30 p.m - 7:30 p.m",
        "description": "GIRL RISING AND EMPOWERMENT THROUGH EDUCATIONThis 2013 documentary tells the story of nine girls from different parts of the world whose societies and environments limit education for females. Each faces obstacles such as arranged marriages, child slavery, poverty, ca-tastrophe and violence, yet all break barriers through education. Professor Sapra will lead the discussion following the film.",
        "id": "5",
        "location": "Folsom campus, Aspen Hall FL1-8",
        "title": "Women's History Month Film - Girl Rising"
    },
    {
        "date": "03/29/2017 | 9:30 a.m - 11:00 a.m",
        "description": "INTRODUCTION TO FEMINISMJoin Professors Price and Carlson in Price's ENGWR302 Class for an intro-ductory lesson on feminism followed by a rousing discussion of the issues with thoughtful peers who enjoy the pithy and provocative.",
        "id": "6",
        "location": "Rancho Cordova Center, RCC1-227",
        "title": "Introduction to Feminism"
    },
    {
        "date": "03/29/2017 | 12 PM - 1:00 p.m",
        "description": "Prepare for the Folsom Lake College Annual Career & Internship Fair on April 5thStudents will have the opportunity to explore career options, jobs, and internships, while introducing themselves and their resume to over 50 employers from throughout the region. These companies and organizations are specifically looking for community college students to hire for full-time and part-time jobs, in addition to internship and volunteer opportunities.",
        "id": "7",
        "location": "Folsom campus, Falcon's Roost FR-115",
        "title": "Career Fair Prep & Interview Skills"
    },
    {
        "date": "03/29/2017 | 1:00 p.m - 3:00 p.m",
        "description": null,
        "id": "8",
        "location": "Folsom campus,  Falcon's Roost, FR-115",
        "title": "Drop-in Resume Review"
    },
    {
        "date": "03/30/2017 | 7:00 p.m - 9:00 p.m",
        "description": "This group of talented FLC Music students will take us on an exploration of American Musical Culture. From country to soul, rock to R&B, funk to folk to hip-hop and beyond, we will take a tour of the amazing tapestry that is American Music, and American Life.The Commercial Music Ensemble will be performing the music of artists ranging from John Denver to John Legend and many more in between.For more information, click here.",
        "id": "9",
        "location": "Folsom campus, Harris Center, Stage 2",
        "title": "Commercial Music Ensemble presents Soul of America"
    },
    {
        "date": "03/31/2017 | 2:30 p.m - 4:30 p.m",
        "description": "As part of Student Organization for Developing Art (SODA) activities and to celebrate Women's History Month, SODA is featuring W.A.R. (Women, Art, Revolution). The documentary is 83 minutes long. There will be a discussion following the film. For more information about the documentary, contact Eunyoung Hwang, faculty advisor for SODA, at hwange@flc.losrios.edu",
        "id": "10",
        "location": "Harris Center PAC-1062",
        "title": "Film: Women, Art, Revolution"
    }
]